In [ ]:
USE ROLE ACCOUNTADMIN;
create database if not exists gitsampledb;
create schema if not exists gitsampleschema;

#### 31/08/2025

In [ ]:
SELECT 
    max(salary)    
FROM employees
WHERE salary <
(
    SELECT 
        max(salary)
    FROM employees
)

In [ ]:
SELECT 
    *    
FROM employees
WHERE salary >
(
    SELECT 
        avg(salary)
    FROM employees
)

In [ ]:
-- Using CTE and window functions
WITH nth_sal 
AS 
(
    select 
        *,
        row_number() over(order by salary desc) as highsal
    from employees
)

select * from nth_sal where highsal = 3;

-- Using subquery and window functions

select 
    *
from 
(
    select 
        *,
        row_number() over(order by salary desc) as highsal
    from employees
) as highsal
where highsal = 2;

-- Without using CTE, subquery or ranking function

select * from employees order by salary desc limit 1 offset 1 ; -- here, we get the 2nd highest and offset value can be altered depend on nth value.

In [ ]:
-- using count

select 
    emp_id, -- column names can be added/altered as per requirement
    count(1) as dup_count
from employees
group by emp_id
having count(1) > 1;

-- using CTE and windowing functions

with dup_records
as
(
    select
        *,
        row_number() over(partition by firstname, lastname order by emp_id) as dup_order
    from employees
    
)

select * from dup_records where dup_order > 1;

In [ ]:
DELETE FROM employees
WHERE emp_id NOT IN 
(
    SELECT MIN(emp_id)
    FROM employees
    GROUP BY firstname, lastname
);

In [ ]:
-- using CTE

with same_sal
as
(
    select salary, count(1) as sal_count from employees
    group by salary 
    having count(1) > 1
)
select * from employees
where salary in (select salary from same_sal);

-- using window functions

SELECT *
FROM (
    SELECT e.*, COUNT(*) OVER(PARTITION BY salary) AS sal_count
    FROM employees e
) t
WHERE sal_count > 1;

-- using self join

SELECT e1.*
FROM employees e1
JOIN employees e2 
  ON e1.salary = e2.salary 
 AND e1.emp_id <> e2.emp_id;

In [ ]:
--straightforward

SELECT *
FROM employees
WHERE DATEDIFF(day, hiredate, CURRENT_DATE) < 30;


--using subquery (optional)

select * from
(
    select *, datediff(day, hiredate, current_date()) as empie from employees
) as datedifftable
where empie < 30
order by empie asc;


--using window functions

with hirediff
as 
(
    select e.*, datediff(day, hiredate, current_date()) as empie from employees e
)

select e.* from hirediff as e where empie < 30;

In [ ]:
-- using window functions
with
sal_ranked
as
(
    select
        *,
        dense_rank() over(order by salary desc) as sal_rank
    from employees
)
select 
    distinct salary 
from 
    sal_ranked 
where 
    sal_rank <=3
order by 
    salary desc

In [ ]:
-- using intersect

select * from employees
intersect
select * from employees;

-- using EXISTS

SELECT *
FROM employees e
WHERE EXISTS (
    SELECT 1
    FROM employees e1
    WHERE e1.emp_id = e.emp_id);

#### 02/09/2025

In [ ]:
-- How would you find all the managers who do not manage any employees?

SELECT m.emp_id, m.firstname AS manager_name
FROM employees m
LEFT JOIN employees e
  ON e.manager_id = m.emp_id
WHERE e.emp_id IS NULL;

In [ ]:
-- Write a SQL query to display the departments with more than 10 employees.

select 
    d.dept_id,
    d.dept_name,
    count(e.emp_id) as dept_emp_count
from 
    dept d
join 
    employees e 
on 
    e.dept_id = d.dept_id 
group by
    d.dept_id, d.dept_name
having count(e.emp_id) > 10

In [ ]:
-- How do you find the names of employees that start with ‘A’?

select
    firstname,
    middlename,
    lastname
from 
    employees
where firstname ILIKE 'a%'

In [ ]:
-- Write a query to retrieve the employee details along with their manager details.

select
    e.emp_id as employee_id,
    m.manager_id as manager_id,
    e.firstname as employeename,
    m.firstname as managername
from
    employees e
left join
    employees m
on e.manager_id = m.emp_id

In [ ]:
-- Write a SQL query to get the employee with the highest salary per department.

select
    firstname,
    lastname,
    salary,
    dept_id
from
(
    select 
        *,
        row_number() over(partition by dept_id order by salary desc) as dept_sal
    from employees  
) as emp_high_sal
where dept_sal = 1
order by dept_id asc

In [ ]:
-- Write a query to find the total salary paid to each department.

select
    dept_id,
    sum(salary) as total_dept_sal
from
    employees
group by dept_id
order by total_dept_sal desc

#### 03/09/2025

In [ ]:
-- How would you find employees who work in more than one department?
select
    emp_id,
    count(distinct dept_id) as emp_work_dept_count
from
    employees
group by
    emp_id
having
    emp_work_dept_count > 1
order by
    emp_work_dept_count desc

In [ ]:
-- Write a query to fetch the employee details along with their salary in ascending order.

select
    emp_id,
    firstname,
    lastname,
    salary
from 
    employees
order by 
    salary asc

In [ ]:
-- Write a SQL query to find all employees whose department is not in the IT department.

select
    e.emp_id,
    e.firstname,
    e.lastname,
    d.dept_name
from    
    employees e
join
    dept d
on e.dept_id = d.dept_id
where d.dept_name NOT ILIKE 'IT%'

In [ ]:
-- How do you retrieve the last record from a table?

--“In SQL, rows are unordered, so there’s no concept of a ‘last record’ without an ORDER BY. If we have a meaningful column like created_at or an auto-increment id, we can use ORDER BY … DESC LIMIT 1 to fetch the latest.”

select
    *
from employees
order by hiredate desc limit 1

In [ ]:
-- Write a query to count the number of employees in each department.

select
    d.dept_id,
    d.dept_name,
    count(e.emp_id) as num_of_employees
from 
    dept d
join
    employees e
on 
    d.dept_id = e.dept_id
group by
    d.dept_id, d.dept_name
order by 
    num_of_employees desc